Test YCSB/WC-RUN-300K
mongodb WC 300K RUN

=16, Avg=4110, 90=8207, 99=8207, 99.9=8207, 99.99=8207] 
[OVERALL], RunTime(ms), 336309
[OVERALL], Throughput(ops/sec), 892.0367875971205
[TOTAL_GCS_PS_Scavenge], Count, 232
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1476
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4388820994977833
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 232
[TOTAL_GC_TIME], Time(ms), 1476
[TOTAL_GC_TIME_%], Time(%), 0.4388820994977833
[READ], Operations, 300000
[READ], AverageLatency(us), 2208.211006666667
[READ], MinLatency(us), 123
[READ], MaxLatency(us), 1698815
[READ], 95thPercentileLatency(us), 5959
[READ], 99thPercentileLatency(us), 11871
[READ], Return=OK, 300000
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 4110.0
[CLEANUP], MinLatency(us), 16
[CLEANUP], MaxLatency(us), 8207
[CLEANUP], 95thPercentileLatency(us), 8207
[CLEANUP], 99thPercentileLatency(us), 8207

########################################################################
CASSANDRA DB WC 300K RUN

Min=11, Avg=1120773,5, 90=2242559, 99=2242559, 99.9=2242559, 99.99=2242559] 
[OVERALL], RunTime(ms), 326912
[OVERALL], Throughput(ops/sec), 917.6781519185591
[TOTAL_GCS_PS_Scavenge], Count, 112
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 563
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.17221759984338295
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 112
[TOTAL_GC_TIME], Time(ms), 563
[TOTAL_GC_TIME_%], Time(%), 0.17221759984338295
[READ], Operations, 300000
[READ], AverageLatency(us), 2136.6802766666665
[READ], MinLatency(us), 258
[READ], MaxLatency(us), 1210367
[READ], 95thPercentileLatency(us), 4263
[READ], 99thPercentileLatency(us), 11695
[READ], Return=OK, 300000
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 1120773.5
[CLEANUP], MinLatency(us), 11
[CLEANUP], MaxLatency(us), 2242559
[CLEANUP], 95thPercentileLatency(us), 2242559
[CLEANUP], 99thPercentileLatency(us), 2242559